# Задача 6: Каталог материалов (списки)

# 1. Создаем начальный список из 5 строительных материалов
materials = ["Кирпич", "Цемент", "Песок", "Арматура", "Бетон"]

# Вывод начального состояния списка
print(f"Исходный каталог: {materials}")
