# Задача 9: Очистка адресов объектов

# Исходный список адресов с ошибками форматирования
addresses = [
    "  г. Москва, ул. Ленина, д. 10 ",
    "г.Казань,ул.Баумана,д.15",
    " г.Санкт-Петербург, ул. Невский, д. 100 "
]

print("=== СРАВНЕНИЕ АДРЕСОВ ===")

for i, addr in enumerate(addresses, 1):
    # 1. Удаляем лишние пробелы в начале и конце
    cleaned = addr.strip()
    
    # 2. Унифицируем пробелы после сокращений (г., ул., д.)
    # Заменяем "д." на "д. " и исправляем, если получилось два пробела "д.  "
    cleaned = cleaned.replace("г.", "г. ").replace("ул.", "ул. ").replace("д.", "д. ")
    cleaned = cleaned.replace("  ", " ") # Убираем двойные пробелы, если они появились
    
    # Вывод результата для каждого адреса
    print(f"#{i}")
    print(f"ДО: '{addr}'")
    print(f"ПОСЛЕ: '{cleaned}'")
    print("-" * 20)
