# Задача 7: Прайс-лист материалов (Работа со словарями)

# Шаг 1. Создаём словарь с 5 материалами и ценами
prices = {
    "Кирпич": 20,
    "Цемент": 525,
    "Песок": 810,
    "Арматура": 180,
    "Бетон": 4500
}

print(f"Исходный прайс-лист: {prices}")

# Шаг 2: Манипуляции со словарем
# Добавление 2 новых материалов
prices["Доска"] = 650
prices["Гвозди"] = 152

# Изменение цены одного материала (+10%)
prices["Цемент"] = prices["Цемент"] * 1.1

# Удаление одного материала
prices.pop("Песок")

# Расчет средней цены
all_prices = prices.values()
average_price = sum(all_prices) / len(all_prices)


# Вывод итогов
print("=== ИТОГОВЫЙ ПРАЙС-ЛИСТ ===")
for material, price in prices.items():
    print(f"{material}: {round(price, 2)} руб.")

print(f"\nСредняя цена материалов: {round(average_price, 2)} руб.")
